app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    ## @cart.line_items.build(product: product)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-05-11 07:51:01.319380"], ["updated_at", "2018-05-11 07:51:01.319380"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 7], ["created_at", "2018-05-11 07:29:39.117945"], ["product_id", 3], ["updated_at", "2018-05-11 07:29:39.117945"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 10  [["quantity", 3], ["updated_at", "2018-05-11 09:33:36.980717"]]